package k_상속;

public class a_상속의개념 {
	/*객체지향을 통해서 달성하고자 하는 목표 중에서 가장 중요한 것은 재활용성일 것이다
	상속은 객체지향의 재활용성을 극대화시킨 프로그래밍 기법이라고 할 수 있다.
	상속(Inheritance)이란 물려준다는 의미다.
	어떤 객체가 있을 때 그 객체의 필드(변수)와 메소드를 다른 객체가 물려 받을 수 있는 기능을 상속이라고 한다.
	부모와 자식의 관계에 따른 비유
	 
	 기존의 객체를 그대로 유지하면서 어떤 기능을 추가하는 방법이 없을까?
	 
	 이런 맥락에서 등장하는 것이 상속이다. 
	 
	 즉 기존의 객체를 수정하지 않으면서 새로운 객체가 기존의 객체를 기반으로 만들어지게 되는 것이다.
	 
	 코드의 중복제거! 가독성 증가!유지보수 편의성
	 
	 이때 기존의 객체는 기능을 물려준다는 의미에서 부모 객체가 되고
	 새로운 객체는 기존 객체의 기능을 물려받는다는 의미에서 자식 객체가 된다. 
	 부모 클래스와 자식 클래스의 관계를 상위(super) 클래스와 하위(sub) 클래스라고 표현하기도 한다. */
}