package c_데이터타입;
public class a데이터의크기와종류 {
/*======================================================================================
1.데이터의 크기
8 bit (비트)				=	1 byte
1024 byte (바이트)		=	1 kilobyte
1024 kilobyte (킬로바이트)	=	1 megabyte
1024 megabyte (메가바이트)	=	1 gigabyte
1024 gigabyte (기가바이트)	=	1 terabyte
1024 terabyte (테라바이트)	=	1 petabyte
1024 petabyte (페타바이트)	=	1 exabyte
1024 exabyte (엑사바이트)	=	1 zettabyte
======================================================================================
2.정수형
데이터 타입	    메모리의 크기	        표현 가능 범위
byte		1 byte		-128 ~ 127
short		2 byte		-32,768 ~ 32,767
int			4 byte		-2,147,483,648 ~ 2,147,483,647
long		8 byte		-9,223,372,036,854,775,808 ~ 9,223,372,036,854,775,807
======================================================================================
3.실수형- 실수형은  double과 float가 있다. 실수를 사용할 때는 가급적 double을 사용

float	4byte	-3.4E38 ~ +3.4E38(±(1.40129846432481707e-45 ~ 3.40282346638528860e+38))
더블보다 더 적은숫자 표현

double	8byte	-1.7E308 ~ +1.7E308(±(4.94065645841246544e-324d ~ 1.79769313486231570e+308d))
플롯트 보다 더 큰숫자 표현
======================================================================================
4.문자형
char/2byte/	모든 유니코드 문자 / 표현범위: 0~65,535 /

자바에서는 문자와 문자열이 다르다. 문자(character)는 글자 하나를 의미하고, 문자열은 글자들의 집합을 의미한다. 
그럼 문자열은 메모리를 얼마나 사용할까? 문자열은 문자의 집합이라고 했다. 문자는 char 형이고, char는 2byte의 메모리를 사용한다. 
따라서 6글자를 담고 있는 String 타입의 변수는 12byte의 공간을 차지하게 된다.
*/
}
