package f_배열;
//배열의 한계

public class f_배열의한계3 {
    	//엘리먼트를 삭제해도 빈자리가 남아 불필요한 공간을 차지한다//물론 조건문으로 빈자리는 제외해도 됩니다.
	    //하지만 리스트는 삭제가 가능하다//하지만 인덱스를 활용 못한다
	 	//또 배열에서 설정된 엘리먼트의 개수를 알아낼 수 없는 것도 불편합니다.
		//만약 값이 지정된 배열의 개수를 알고 싶다면 어떻게 해야 할까요? 자바의 배열에서는 이런 기능이 기본적으로 제공되지 않습니다. 
		//만약 이걸 알고 싶다면 데이터를 넣거나 제거할 때 어딘가에 기록해두어야 합니다.
		//하지만 배열의 크기는 알수있다
		//리스트는 배열의 값의 갯수를 알수있다	
		// 배열의 크기를 변경할 수 없는 것은 몹시 불편
	
	//하지만 배열이 쓸모가 없는 것은 아닙니다. 데이터의 크기가 확정적일 때 배열을 사용하는 것이 메모리나 처리속도 면에서 좋습니다.
	//또한 배열은 다른 데이터 스트럭쳐의 부품이 되기도 합니다
	/*배열은 다수의 데이터를 그룹핑해서 효율적으로 관리할 수 있는 데이터 스트럭쳐입니다. 
	배열의 가장 큰 특징은 인덱스가 있다는 것입니다. 만약 인덱스를 알고 있다면 인덱스를 이용해서 데이터를 가져올 수 있습니다.
	인덱스를 이용한 데이터의 조회는 매우 빠르게 처리 됩니다. 
	하지만 인덱스를 이용해서 데이터를 가져오려면 데이터에 대한 인덱스의 값이 고정되어야 합니다.
	자연스럽게 어떤 엘리먼트가 삭제되면 삭제된 상태를 빈 공간으로 남겨둬야 합니다.
	이것은 메모리의 낭비를 초래합니다. 또한 배열에 데이터가 있는지 없는지를 체크하는 로직이 필요하다는 의미이기도 합니다.
	리스트는 배열이 가지고 있는 인덱스라는 장점을 버리고 대신 
	빈틈없는 데이터의 적재라는 장점을 취한 데이터 스트럭쳐라고 할 수 있습니다.
	대신 인덱스는 더 이상 식별자로 사용할 수 없습니다.*/
}

	   	
    
    
    
    
    
    
    
    
    
    
    